Catalogs/РегламентированныеОтчеты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>РегламентированныеОтчеты</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИсточникОтчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Периоды</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВнешнийОтчетИспользовать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВнешнийОтчетХранилище</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВнешнийОтчетВерсия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УИДОтчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьНеПоказыватьВСписке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КешСхемЗвит1САктуален</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КешСхемЗвит1С</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяСхемыЗвит1С</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>8</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяФормы</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяОбласти</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/РегламентированныеОтчеты/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
//+++	
// Возвращает реквизиты справочника, которые образуют естественный ключ
//  для элементов справочника.
//
// Возвращаемое значение: Массив(Строка) - массив имен реквизитов, образующих
//  естественный ключ.
//
Функция ПоляЕстественногоКлюча() Экспорт
	
	Результат = Новый Массив();
	
	Результат.Добавить("ИсточникОтчета");
	
	Возврат Результат;
	
КонецФункции

// Функция возвращает регламентированный отчет по переданой ссылке на справочник
//
Функция ПолучитьРегламентированныйОтчетПоСсылке(Ссылка) Экспорт
	
	ИсточникОтчета = Ссылка.ИсточникОтчета;
	Если Не ЗначениеЗаполнено(ИсточникОтчета) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если Ссылка = РегламентированнаяОтчетность.ПолучитьРеглОтчетПоУмолчанию(ИсточникОтчета) Тогда
		Возврат РегламентированнаяОтчетность.РеглОтчеты(ИсточникОтчета);
	КонецЕсли;
	
	Если Не Ссылка.ВнешнийОтчетИспользовать Тогда
		Если Метаданные.Отчеты.Найти(ИсточникОтчета) <> Неопределено Тогда
			Возврат Отчеты[ИсточникОтчета];
		Иначе        
			Возврат Неопределено;
		КонецЕсли; 
	Иначе
		Попытка
			ВременныйФайл = ПолучитьИмяВременногоФайла();
			Ссылка.ВнешнийОтчетХранилище.Получить().Записать(ВременныйФайл);
			ВнешнийОтчет = ВнешниеОтчеты.Создать(ВременныйФайл);
			Попытка
				ВнешнийОтчет.мПолноеИмяФайлаВнешнейОбработки = ВременныйФайл;
			Исключение
			КонецПопытки;
			Возврат ВнешнийОтчет;
		Исключение
			Возврат Неопределено;
		Конецпопытки;
	
	КонецЕсли;
	
КонецФункции

// Функция получает список поддерживаемых схем из ТекОтчет,
// дополняет им переденную кеш таблицу и возвращает массив добавленных строк
Процедура ДополнитьКешТаблицу(ПараметрОтчет, КешТаблица) Экспорт
	
	ТекущийОтчет = ПолучитьРегламентированныйОтчетПоСсылке(ПараметрОтчет);
	
	ТекОтчетМетаданные = Метаданные.НайтиПоТипу(ТипЗнч(ТекущийОтчет));
	
	Если ТекОтчетМетаданные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекОтчетМетаданные.Макеты.Найти("ПоказателиЗвит1С") = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	МакетПоказателиЗвит1С = ТекущийОтчет.ПолучитьМакет("ПоказателиЗвит1С");
	МакетПоказателиЗвит1С.КодЯзыкаМакета = "ru";
	
	Если МакетПоказателиЗвит1С.Области.Найти("Структура") = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОбластьСтруктура = МакетПоказателиЗвит1С.ПолучитьОбласть("Структура");
	
	Для сч = 1 По ОбластьСтруктура.ВысотаТаблицы Цикл
		ИмяСхемыЗвит1С = СокрЛП(ОбластьСтруктура.Область(сч, 1, сч, 1).Текст);
		ИмяОбласти     = СокрЛП(ОбластьСтруктура.Область(сч, 2, сч, 2).Текст);
		ИмяФормыОтчета = СокрЛП(ОбластьСтруктура.Область(сч, 3, сч, 3).Текст);
		
		Если ПустаяСтрока(ИмяСхемыЗвит1С) ИЛИ Лев(ИмяСхемыЗвит1С, 2)= "//" 
		 ИЛИ ПустаяСтрока(ИмяФормыОтчета) Тогда
			Продолжить; 
		КонецЕсли;
		
		// Для наглядности не заполняем параметр "ИмяОбласти" если он совпадает с "ИмяСхемы"
		Если ПустаяСтрока(ИмяОбласти) Тогда
			ИмяОбласти = ИмяСхемыЗвит1С;
		КонецЕсли;
		
		НоваяСтрока = КешТаблица.Добавить();
		
		НоваяСтрока.ИмяСхемыЗвит1С = ИмяСхемыЗвит1С;
		НоваяСтрока.ИмяФормы	   = ИмяФормыОтчета;
		НоваяСтрока.ИмяОбласти     = ИмяОбласти;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецЕсли
